src/Conversion_3_Plus/Catalogs/Конвертации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>Конвертации</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АлгоритмПередКонвертацией</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПослеКонвертации</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПередОтложеннымЗаполнением</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Conversion_3_Plus/Catalogs/Конвертации/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Возвращает параметры конвертации.
//
// Параметры:
//  ИмяКонвертации - Строка - Имя конвертации.
// 
// Возвращаемое значение:
//   - Структура.
//
Функция ЗаполнитьПараметрыКонвертации(ИмяКонвертации) Экспорт
	
	ПараметрыКонвертации = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонвертацииПараметры.Параметр КАК Параметр
		|ИЗ
		|	Справочник.Конвертации.Параметры КАК КонвертацииПараметры
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Конвертации КАК Конвертации
		|		ПО КонвертацииПараметры.Ссылка = Конвертации.Ссылка
		|ГДЕ
		|	Конвертации.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", ИмяКонвертации);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ПараметрыКонвертации.Вставить(ВыборкаДетальныеЗаписи.Параметр, "");
	КонецЦикла;
	
	Возврат ПараметрыКонвертации;
	
КонецФункции

#КонецОбласти
